books/TheMathematicsofLanguage.org
#+TITLE: \myfont The @@latex:\\@@ Mathematics of Language
#+AUTHOR: Marcus Kracht

#+OPTIONS: toc:2
#+LATEX_HEADER: \input{preamble.tex}
#+LATEX_HEADER: \setcounter{secnumdepth}{2}
#+LATEX_HEADER: \setcounter{tocdepth}{2}
#+EXPORT_FILE_NAME: ../latex/TheMathematicsofLanguage/TheMathematicsofLanguage.tex
#+LATEX_HEADER: \DeclareMathOperator{\Tm}{Tm}


* Fundamental Structures
** Algebra and Structures
   We define \(M+N:=M\times\{0\}\cup N\times\{1\}\). This is called the
   *disjoint union*
   
   If \(R\subseteq M\times N\) is a relation, we write 
   \(R^\smallsmile:=\{\la x,y\ra:yRx\}\) for the so-called *converse of* $R$. We
   put \(\Delta_M:=\{\la x,x\ra:x\in M\}\) and call this set the *diagonal on*
   $M$. Now put
   \begin{alignat*}{2}
   &R^0:=\Delta_M\hspace{2cm} &&R^{n+1}:=R\circ R^n\\
   &R^+:=\displaystyle\bigcup_{0<i\in\omega}R^i\hspace{2cm}
   &&R^{*}:=\displaystyle\bigcup_{i\in\omega}R^i
   \end{alignat*}

   $R^+$ is called the *transitive closure of* $R$.

   An *\(n\)-ary relation* on $M$ is a subset of \(M^n\), an *\(n\)-ary function* on
   $M$ is a function \(f:M^n\to M\). A 0-ary function on $M$ is a function
   \(c:1\to M\). We also call it a *constant*.

   Now let $F$ be a set and \(\Omega:F\to\omega\). The pair \(\la F,\Omega\ra\) also
   denoted by \Omega alone, is called a *signature* and $F$ the set of *function symbols*

   #+ATTR_LATEX: :options []
   #+BEGIN_definition
   Let \(\Omega:F\to \omega\) be a signature and $A$ a nonempty set. Furthur, let \Pi
   be a mapping which assigns to every \(f\in F\) an \(\Omega(f)\)-ary function on
   $A$. Then we call the pair \(\fA:=\la A,\Pi\ra\) and *\(\Omega\)-algebra*.
   #+END_definition

   In order not to get drowned in notation we write \(f^\fA\) for the function
   \(\Pi(f)\). 

   The set of \(\Omega\)-terms is the smallest set \(\Tm_\Omega\) s.t. if \(f\in
   F\) and \(t_i\in\Tm_\Omega\), \(i<\Omega(f)\), also
   \(f(t_0,\dots,t_{\Omega(f)-1})\in\Tm_\Omega\). To begin with we define the *level*
   of a term. If \(\Omega(f)=0\), then \(f()\) is a term of level 0, which we also
   denote by 'f'. If \(t_i,i<\Omega(f)\), are terms of level \(n_i\), then
   \(f(t_0,\dots,t_{\Omega(f)-1})\) is a term of level \(1+\max\{n_i:i<\Omega(f)\}\).
   We therefore speak about /induction on the construction of the term/. Two terms
   $u$ and $v$ are equal, in symbols \(u=v\), if they have identical level and
   either they are both of level 0 and there is an \(f\in F\) such \(u=v=f()\)
   or there is an \(f\in F\) and terms \(s_i,t_i,i<\Omega(f)\), s.t.
   \(u=f(s_0,\dots,s_{\Omega(f)-1})\) and \(v=f(t_0,\dots,t_{\Omega(f)-1})\) as well as
   \(s_i=t_i\) for all \(i<\Omega(f)\)

   




   
