latex/TheMathematicsofLanguage/TheMathematicsofLanguage.tex
% Created 2020-04-09 四 00:31
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{imakeidx}
\usepackage{hyperref}
\usepackage{minted}
\input{preamble.tex}
\setcounter{secnumdepth}{2}
\setcounter{tocdepth}{2}
\DeclareMathOperator{\Tm}{Tm}
\author{Marcus Kracht}
\date{\today}
\title{\myfont The \\ Mathematics of Language}
\hypersetup{
 pdfauthor={Marcus Kracht},
 pdftitle={\myfont The \\ Mathematics of Language},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3.6)}, 
 pdflang={English}}
\begin{document}

\maketitle \clearpage
\setcounter{tocdepth}{2}
\tableofcontents \clearpage

\section{Fundamental Structures}
\label{sec:orgd88c96b}
\subsection{Algebra and Structures}
\label{sec:org880f47f}
We define \(M+N:=M\times\{0\}\cup N\times\{1\}\). This is called the
\textbf{disjoint union}

If \(R\subseteq M\times N\) is a relation, we write 
\(R^\smallsmile:=\{\la x,y\ra:yRx\}\) for the so-called \textbf{converse of} \(R\). We
put \(\Delta_M:=\{\la x,x\ra:x\in M\}\) and call this set the \textbf{diagonal on}
\(M\). Now put
\begin{alignat*}{2}
&R^0:=\Delta_M\hspace{2cm} &&R^{n+1}:=R\circ R^n\\
&R^+:=\displaystyle\bigcup_{0<i\in\omega}R^i\hspace{2cm}
&&R^{*}:=\displaystyle\bigcup_{i\in\omega}R^i
\end{alignat*}

\(R^+\) is called the \textbf{transitive closure of} \(R\).

An \textbf{\(n\)-ary relation} on \(M\) is a subset of \(M^n\), an \textbf{\(n\)-ary function} on
\(M\) is a function \(f:M^n\to M\). A 0-ary function on \(M\) is a function
\(c:1\to M\). We also call it a \textbf{constant}.

Now let \(F\) be a set and \(\Omega:F\to\omega\). The pair \(\la F,\Omega\ra\) also
denoted by \(\Omega\) alone, is called a \textbf{signature} and \(F\) the set of \textbf{function symbols}

\begin{definition}[]
Let \(\Omega:F\to \omega\) be a signature and \(A\) a nonempty set. Furthur, let \(\Pi\)
be a mapping which assigns to every \(f\in F\) an \(\Omega(f)\)-ary function on
\(A\). Then we call the pair \(\fA:=\la A,\Pi\ra\) and \textbf{\(\Omega\)-algebra}.
\end{definition}

In order not to get drowned in notation we write \(f^\fA\) for the function
\(\Pi(f)\). 

The set of \(\Omega\)-terms is the smallest set \(\Tm_\Omega\) s.t. if \(f\in
   F\) and \(t_i\in\Tm_\Omega\), \(i<\Omega(f)\), also
\(f(t_0,\dots,t_{\Omega(f)-1})\in\Tm_\Omega\). To begin with we define the \textbf{level}
of a term. If \(\Omega(f)=0\), then \(f()\) is a term of level 0, which we also
denote by 'f'. If \(t_i,i<\Omega(f)\), are terms of level \(n_i\), then
\(f(t_0,\dots,t_{\Omega(f)-1})\) is a term of level \(1+\max\{n_i:i<\Omega(f)\}\).
We therefore speak about \emph{induction on the construction of the term}. Two terms
\(u\) and \(v\) are equal, in symbols \(u=v\), if they have identical level and
either they are both of level 0 and there is an \(f\in F\) such \(u=v=f()\)
or there is an \(f\in F\) and terms \(s_i,t_i,i<\Omega(f)\), s.t.
\(u=f(s_0,\dots,s_{\Omega(f)-1})\) and \(v=f(t_0,\dots,t_{\Omega(f)-1})\) as well as
\(s_i=t_i\) for all \(i<\Omega(f)\)
\end{document}